public class Main {
    public static void main(String[] args) {

        int cena = 2370; // рублей, цена одного билета
        int mile = 20; // рублей бонус за 1 милю

        System.out.println((cena / mile) + "рублей бонус");

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}